app/views/landscapers/index.html.erb

SELECT "services".* FROM "services"
---
    <%= form_for :landscaper, controller: "landscapers_controller", url: landscapers_service_path, action: :post do |f| %>
        <%= f.collection_select(:service_ids, Service.all, :id, :description) %>

SELECT "services".* FROM "services" INNER JOIN "landscaper_services" ON "services"."id" = "landscaper_services"."service_id" WHERE "landscaper_services"."landscaper_id" = $1  [["landscaper_id", 1]]
SELECT 1 AS one FROM "services" INNER JOIN "landscaper_services" ON "services"."id" = "landscaper_services"."service_id" WHERE "landscaper_services"."landscaper_id" = $1 LIMIT $2  [["landscaper_id", 1], ["LIMIT", 1]]
---
            <p><%= "Description: " + landscaper.description if landscaper.description%></p>
            <strong><%= "Services: " unless landscaper.services.empty? %></strong>
                <ul> <% landscaper.services.each do |service| %>