app/controllers/appointments_controller.rb

    def show
        if current_landscaper && current_landscaper.appointment_ids.include?(params[:id].to_i)
            @appointment = Appointment.find(params[:id])
        elsif current_user && current_user.appointment_ids.include?(params[:id].to_i)
---
SELECT "appointments"."id" FROM "appointments" WHERE "appointments"."landscaper_id" = $1  [["landscaper_id", 4]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "appointments"."id" FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 2]]
SELECT 1 AS one FROM "appointments" WHERE "appointments"."user_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 8], ["LIMIT", 1]]