app/controllers/appointments_controller.rb

SELECT "landscapers".* FROM "landscapers" WHERE "landscapers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            @appointments = User.find(params[:user_id]).appointments
        elsif params[:landscaper_id]
            @appointments = Landscaper.find(params[:landscaper_id].appointments)