app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("landscaper_id", "user_id", "datetime", "frequency", "recurring", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        appointment = Appointment.new(appointment_params)
        if appointment.save

SELECT "appointments".* FROM "appointments" WHERE (landscaper_id = current_landscaper.id)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "landscapers".* FROM "landscapers" WHERE "landscapers"."id" = $1 ORDER BY "landscapers"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE (landscaper_id = current_landscaper.id) LIMIT $1  [["LIMIT", 11]]
---
    def index
        if params[:user_id]
            if params[:user_id] == current_user.id.to_s
                @appointments = User.find(params[:user_id]).appointments
            else
                flash[:notice] = "Invalid URL for current user."
                redirect_to user_appointments_path(current_user)
            end
        elsif params[:landscaper_id]
            if params[:landscaper_id] == current_landscaper.id.to_s
                @appointments = Landscaper.find(params[:landscaper_id].appointments)

DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 6]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        Appointment.find(params[:id]).destroy