app/controllers/landscapers_controller.rb

    def index
        if params[:landscaper]
            @landscapers = Service.find(params[:landscaper][:service_ids]).landscapers
        elsif params[:commit] == "Sort A-Z"
            @landscapers = Landscaper.alphabetical
        elsif params[:commit] == "Sort Z-A"
            @landscapers = Landscaper.reverse_alphabetical
        else
            @landscapers = Landscaper.all
---
SELECT "landscapers".* FROM "landscapers" WHERE (service_ids.include?(params[:landscaper][:service_ids].to_i)) LIMIT $1  [["LIMIT", 11]]
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "landscapers".* FROM "landscapers"
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]