app/controllers/landscapers_controller.rb

    def show
        @landscaper = Landscaper.find(params[:id])
---
SELECT "landscapers".* FROM "landscapers" WHERE "landscapers"."id" = $1 ORDER BY "landscapers"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]