app/controllers/landscapers_controller.rb

SELECT "services"."id" FROM "services" INNER JOIN "landscaper_services" ON "services"."id" = "landscaper_services"."service_id" WHERE "landscaper_services"."landscaper_id" = $1  [["landscaper_id", 2]]
---
    def index
        if params[:landscaper]
            # @landscapers = Landscaper.all.select do |landscaper|
            #     landscaper.service_ids.include?(params[:landscaper][:service_ids].to_i)
            # end
            @landscapers = Landscaper.joins(:landscaper_services).where(landscaper_services: {service_id: params[:landscaper][:service_ids]})