app/models/landscaper.rb

INSERT INTO "services" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Edging"], ["created_at", "2019-10-10 17:21:51.070708"], ["updated_at", "2019-10-10 17:21:51.070708"]]
---
  def services_attributes=(services_attributes)
    services_attributes.values.each do |service_attribute|
      service = Service.find_or_create_by(service_attribute)