app/views/landscapers/registrations/edit.html.erb

    <%= f.label "Services Available" %><br>
    <%= f.collection_check_boxes(:service_ids, Service.all, :id, :description) do |box| %>
---
SELECT "services".* FROM "services"