app/views/landscapers/registrations/new.html.erb

    <%= f.label "Services Available" %><br>
    <%= f.collection_check_boxes(:service_ids, Service.all.sort_by{|s| s.description}, :id, :description) do |box| %>
---
SELECT "services".* FROM "services"